Revit 2027 API
HermiteSpline Class
A Hermite spline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.HermiteSpline
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HermiteSpline : Curve
Public Class HermiteSpline
	Inherits Curve
public ref class HermiteSpline : public Curve
type HermiteSpline =
    class
        inherit Curve
    end
The HermiteSpline type exposes the following members.
Properties
Name | Description
ApproximateLength | The approximate length of the curve.
(Inherited from Curve)
ControlPoints | The control points of the Hermite spline.
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
(Inherited from GeometryObject)
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
(Inherited from GeometryObject)
IsBound | Describes whether the parameter of the curve is restricted to a particular interval.
(Inherited from Curve)
IsClosed | Describes whether the curve is closed.
(Inherited from Curve)
IsCyclic | The boolean value that indicates whether this curve is cyclic.
(Inherited from Curve)
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
(Inherited from GeometryObject)
IsPeriodic | Returns whether the Hermite spline is periodic or not.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Length | The exact length of the curve.
(Inherited from Curve)
Parameters | Returns the params of the Hermite spline.
Period | The period of this curve.
(Inherited from Curve)
Reference | Returns a stable reference to the curve.
(Inherited from Curve)
Tangents | Returns the tangents of the Hermite spline.
Visibility | The visibility.
(Inherited from GeometryObject)
Top
Methods
Name | Description
Clone | Returns a copy of this curve.
(Inherited from Curve)
ComputeClosestPoints |  Find the closest points between two curves. Closest points mean closest pairs of points, each pair consisting of a point on this, say P1, and a point on other curve, say P2. P1 and P2 are closest locally. Each pairs of closest points will be represented by the corresponding parameter values with respect to the two curves and the 3d points. A closest pair is also known as a pair of critical points of the distance function between points of the two curves. If the input parameter returnAllCriticalPoints is set to false, then the function will return only pairs with minimum distance.
(Inherited from Curve)
ComputeDerivatives |  Returns the vectors describing the curve at the specified parameter.
(Inherited from Curve)
ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter.
(Inherited from Curve)
ComputeRawParameter | Computes the raw parameter from the normalized parameter.
(Inherited from Curve)
Create(IList<XYZ>, Boolean) |  Creates a Hermite spline with default tangency at its endpoints.
Create(IList<XYZ>, Boolean, HermiteSplineTangents) |  Creates a Hermite spline with specified tangency at its endpoints.
CreateOffset |  Creates a new curve that is an offset of the existing curve.
(Inherited from Curve)
CreateReversed |  Creates a new curve with the opposite orientation of the existing curve.
(Inherited from Curve)
CreateTransformed |  Crates a new instance of a curve as a transformation of this curve.
(Inherited from Curve)
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Distance | Returns the shortest distance from the specified point to this curve.
(Inherited from Curve)
Equals |  Determines whether the specified Object is equal to the current Object.
(Inherited from GeometryObject)
Evaluate |  Evaluates and returns the point that matches a parameter along the curve.
(Inherited from Curve)
GetEndParameter |  Returns the raw parameter value at the start or end of this curve.
(Inherited from Curve)
GetEndPoint |  Returns the 3D point at the start or end of this curve.
(Inherited from Curve)
GetEndPointReference | Returns a stable reference to the start point or the end point of the curve.
(Inherited from Curve)
GetHashCode |  Gets the integer value of the geometry object as hash code
(Inherited from GeometryObject)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Intersect | Calculates the intersection of this curve with the specified curve.
(Inherited from Curve)
IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds.
(Inherited from Curve)
IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
(Inherited from Curve)
MakeBound | Changes the bounds of this curve to the specified values.
(Inherited from Curve)
MakeUnbound | Makes this curve unbound.
(Inherited from Curve)
Project | Projects the specified point on this curve.
(Inherited from Curve)
SetGraphicsStyleId | Sets the graphics style id for this curve.
(Inherited from Curve)
Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve.
(Inherited from Curve)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The Hermite spline lies in the plane defined by control points.
See Also
Reference
Autodesk.Revit.DB Namespace